{
  "action_movies": {
    "parent": "movie_appearances",
    "label": "Action Movies",
    "matchingEntries": 8234,
    "additionalInfos": [
      {
          "key": "## Action film",
          "value": "is a [genre](https://en.wikipedia.org/wiki/Genre) in which the protagonist or protagonists end up in a series of challenges that typically include violence, extended fighting, physical feats, and frantic chases. Action films tend to feature a resourceful [hero](https://en.wikipedia.org/wiki/Hero) struggling against incredible odds, which include life-threatening situations, a villain, or a pursuit which generally concludes in victory for the hero (though a small number of films in this genre have ended in victory for the villain instead). Advancements in [CGI](https://en.wikipedia.org/wiki/Computer-generated_imagery) have made it cheaper and easier to create action sequences and other [visual effects](https://en.wikipedia.org/wiki/Visual_effect) that required the efforts of professional [stunt](https://en.wikipedia.org/wiki/Stunt) crews in the past. However, reactions to action films containing significant amounts of CGI have been mixed as films that use computer animations to create unrealistic, highly unbelievable events are often met with criticism. While action has long been a recurring component in films, the 'action film' genre began to develop in the 1970s along with the increase of stunts and special effects. Common action scenes in films are generally, but not limited to, car chases, fighting and gunplay or shootouts."
      }
    ]
  },
  "fantasy_movies": {
    "parent": "movie_appearances",
    "label": "Fantasy Movies",
    "matchingEntries": 9374
  },
  "comedies": {
    "parent": "movie_appearances",
    "label": "Comedies",
    "matchingEntries": 2135
  },
  "horror_movies": {
    "parent": "movie_appearances",
    "label": "Horror Movies",
    "matchingEntries": 24093
  },
  "family_movies": {
    "parent": "movie_appearances",
    "label": "Family Movies",
    "matchingEntries": 8431
  },
  "independent_movies": {
    "parent": "movie_appearances",
    "label": "Independent Movies",
    "matchingEntries": 10248
  }
}
